# data/messages.py
START_MESSAGE = """
🌟 Добро пожаловать в Клуб Высоких Приключений!

Наша цель — сделать экстрим доступным, безопасным и комфортным, объединяя профессионализм, любовь к природе и стремление к новым высотам.
 
Здесь вы можете забронировать уникальный полёт на воздушном шаре или познакомиться с горными лыжами.

📌 Что я могу:
- Рассказать о нас
- Показать программы полётов на воздушном шаре
- Принять заявку на обучение катанию на горных лыжах
- Помочь оформить бронирование

Выберите, что вас интересует — и отправляйтесь в приключение прямо сейчас!
"""

ABOUT_CLUB = """
🏔 Клуб Высоких Приключений — это команда энтузиастов, которая делает возможным невозможное: поднимает в небеса на воздушных шарах и учит уверенно скользить по склонам.

✈️ **Полёты на воздушных шарах**
Наши полёты — это не просто прогулка в облаках. Это возможность взглянуть на мир сверху, почувствовать невесомость и стать частью чего-то большего — пространства, где нет границ, кроме тех, что ты сам себе ставишь.

🎿 **Обучение каанию на горных лыжах**
Мы открываем новичкам секреты склонов и помогаем опытным райдерам отточить технику. Наша школа готовится к следующему сезону — будьте готовы к зимнему волшебству!

🪂 Мы любим экстрим, но главная наша ценность — безопасность. Каждый этап подготовки и реализации мы прорабатываем до мелочей, чтобы вы могли сосредоточиться только на одном — получении удовольствия.

📍 С нами вы всегда знаете, что полёт состоится, а первый спуск с горы будет самым лучшим.
"""

BALLOON_MENU = """
🌤 Полёт на воздушном шаре — это волшебство, которое можно потрогать руками.

Вы подниметесь над землёй, оставив суету и шум внизу. Воздух станет чище, ландшафт — живописнее, а чувство свободы — абсолютным.

🎯 Почему выбирают нас:
- Профессиональные пилоты с международным опытом
- Современные аэростаты и безопасность на высшем уровне

🧾 Все наши программы:
- 💠 Solo — индивидуальные полёты
- 📐 Group — групповые приключения (полет состоится при наличии не мении 3 гостей на конкретную дату)
- 🤝 Family — полёты всей семьей (дети до 14 лет)

Выберите программу и нажмите «Забронировать», чтобы зарезервировать дату.
"""

PROGRAM_SOLO = """
🌟 *Соло-программа*
✓ Персональный полёт  
✓ Идеально для тех, кто хочет необычно провести время своей компанией без посторонних людей  
💵 Стоимость:
1-2 чел: 🔥40 000₽ (было 50 000₽)
2 чел: 🔥45 000₽ (было 70 000₽)
3 чел: 🔥55 000₽ (было 80 000₽)
"""

PROGRAM_GROUP = """
👥 *Групповой полёт*
✓ Экономия до 30%
✓ Новые знакомства
💵 Стоимость:
1 чел: 🔥22 500₽ (было 25 000₽)
2 чел: 🔥36 000₽ (было 40 000₽)
3 чел: 🔥45 000₽ (было 50 000₽)
"""

PROGRAM_FAMILY = """
👨‍👩‍👧‍👦 *Семейный полёт*
✓ Специальные условия для семей
💵 Стоимость:
2+1: 🔥54 000₽ (было 60 000₽)
2+2: 🔥63 000₽ (было 70 000₽)
2+3: 🔥72 000₽ (было 80 000₽)
"""

FAQ_TEXT = """
📋 Условия полёта
🌤 Погодные условия:
-Безопасность полета для нас самый важный фактор, поэтому в первую очередь полет зависит от погодных условий. Наша команда следит за погодными условиями на протяжении всего года используя порядка шести источников, от Росгидрометцентра до метеорологических организаций Европы и Америки.

-Для комфортного полёта и мягкой посадки скорость ветра не должна превышать 3 м/с. Так как торможение воздушного шара происходит за счёт прикосновения к земле. Чем больше скорость, тем длиннее тормозной путь.

🌤Атмосферные явления
-Также важное условие - это отсутствие атмосферных осадков, так как при намокании шар становится очень тяжёлым, а при испарении воды шар охлаждается, и ему становится сложно держать высоту, но главное то, что осадки подразумевают наличие локальных туч или целых атмосферных фронтов, в которых имеются непредсказуемые воздушные потоки. 

-Видимость во время полета должна превышать 300 метров. Конечно, наличие утреннего тумана это очень красивое явление, особенно когда удаётся посмотреть на него сверху. Но туман таит в себе много опасностей в виде скрытых линий электро передач, да и вообще любых построек или склонов гор. Кроме тумана возможно такое явление, как низкая облачность. В отличии от тумана не всегда удаётся перепрыгнуть его верхнюю кромку, поэтому вид из корзины будет слабо отличатся от бумажного листа. 
-Если туман образуется в поймах рек (при утренних температурных колебаниях) и плавно рассеивается с восходом солнца, то облачность простирается на много километров, что вызывает угрозу при посадке.

🌤Температура воздуха
-Поскольку мы летаем за счёт разницы температур (горячий воздух внутри шара создает подъемную силу), чтобы свободно маневрировать и летать безопасно, температура за бортом не должна превышать 30° С.
-Зимой летать можно!

👥 Требования к участникам:
- Минимальный возраст: 6 лет (в сопровождении взрослых)
- Максимальный вес: обычно до 110 кг/чел.

Одеваться на полет следует по погоде.
-Рассчитывайте на то, что температура за городом, особенно в поймах рек, всегда ниже на 2-4 градуса. С высотой температура опускается на 0,6° каждые 100 метров. Стандартная высота полёта 300 метров, так что в полете вы не замерзнете).*
-Выбирайте для полёта удобную закрытую обувь, поскольку старты и посадки происходят исключительно в полях. На утренние полёты большим плюсом будет непромокаемая обувь, чтобы весь полет ноги оставались сухими и тёплыми.*
-Для поддержания необходимой для полета температуры требуется постоянно подогревать воздух внутри оболочки (с помощью горелки), поэтому для вашего комфорта рекомендуем взять с собой головной убор.*
- Не допускаются лица в состоянии алкогольного опьянения
- Беременным женщинам на поздних сроках полеты не рекомендуются

📍 Полётная зона:
- Самая красивая и безопасная зона для полетов в г. Сочи находится в окрестностях с. Солохаул (радиусом 6 км).
- Место встречи: [Развилка Солохаул](https://yandex.ru/maps/-/CHvnqAIJ  ) 

✈️ Процедура полёта:
1. Встреча на Развилке
2. Трансфер к месту старта (~15–30 мин)
3. Подготовка шара, инструктаж
4. Полёт (~45–60 мин)
5. Посадка, шампанское
6. Возвращение
⏳ Общее время: ~3 часа
⚠️ Важно: решение о полете принимает командир воздушного судна.
"""

CONTACTS_TEXT = """
📞 Контакты Клуба высоких приключений

Телефон для связи и бронирования:
☎️ [+79603949943]

📱 [WhatsApp](https://wa.me/79603949943 )
💬 [Telegram](https://t.me/Anna_moreva )
 
🕒 График работы: Ежедневно с 4:00 до 22:00 

📍 Адрес офиса: Наш ковёр - цветочная поляна, Наши стены - сосны-великаны.

- [Instagram](https://www.instagram.com/hiad_club?igsh=bTlhcXhkaWtpZGp1&utm_source=qr )
"""

SKI_MESSAGE = """
⛷ Обучение на горных лыжах — ваш первый шаг к настоящему зимнему приключению!

🎓 Наши преимущества:
- Сертифицированные инструкторы высшей А категории
- Разделение на группы по уровню подготовки
- Локации на лучших горнолыжных курортах
 
📌 Мы учим не только технике, но и любви к горам. Потому что катание — это не спорт. Это образ жизни.

❄️ Сейчас мы только готовимся к новому сезону.

📅Скоро тут будут анонсы выездных кемпов на Уральские и Кавказские горы, Хибины и даже Альпы.
"""

FLIGHT_PROCEDURE = """
1.	Традиционное место встречи находится на остановки  «Развилка» (https://yandex.ru/maps/-/CHRrfH0h)

2.	Полеты происходят на восходе солнца и за час до заката солнца (будьте готовы к тому, что летом это около 4 часов утра.)

3.	Так как маршрут полета полностью зависит от направления ветра, то финальное решение о точке старта и примерной траектории полета принимается непосредственно на месте встречи.

4.	Далее вас проводят в комфортабельный трансфер, который отвезет вас в точку старта. У вас есть время познакомиться с пилотом и заполнить необходимые документы.

5.	В точке старта у вас есть около 15 минут свободного времени. За это время можно помогать командам с подготовкой аэростата или созерцать всю красоту на расстоянии. Как только вы увидите корзину воздушного шара подойдите к пилоту, чтобы прослушать инструктаж по посадке на борт.

6.	У каждой корзины в средней части есть отверстие, это ступенька для вашей ноги, перелазить через борт удобней всего держась руками за металлическую перекладину над вашей головой (это рама горелки, да – она выдержит.)

7.	Когда вы услышите рев вентилятора, у вас останется около 5 минут до погрузки на борт, в этот момент самая опасная зона находится в непосредственной близости источника шума – вентилятора, старайтесь держаться от него подальше.

8.	Как только ваш тепловой аэростат примет вертикальное положение подойдите к корзине, для посадки на борт (нам очень не хватает веса вашего тела для стабилизации ситуации.)

9.	И вот вы уже в корзине, занимаете место согласно вашему билету (шутка), занимаете любое удобное место, главное не мешать пилоту в этот ответственный момент. Держаться можно за специальные белые веревочные ручки внутри корзины, запомните их они нам пригодятся на посадке.

10.	 Во время полета, в поисках лучшего вида, можно меняться местами с другими пассажирами, но по взаимной договоренности. Перед приземлением пилот попросит прослушать еще один инструктаж по посадке: держаться за ручки и обязательно согнуть ноги в коленях (для амортизации.)

11.	 После приземления у вас будет около 10 минут чтобы поделиться своими эмоциями с окружающими, пока мы собираем матчасть и приготавливаемся к торжественной части.

12.	 Торжественная часть, после которой можете проходить в трансфер, который отвезет вас к месту встречи.

Вся процедура: встреча, дорога до места старта, подготовка и наполнение воздушного судна 30 минут, полет 45+- 10 минут, сборка аэростата, торжественная часть, обратная дорога 30 минут итого всего процедура занимает около 2х часов.
"""