# data/messages.py
START_MESSAGE = """
🌟 Добро пожаловать в Клуб Высоких Приключений!

Наша цель — сделать экстрим доступным, безопасным и комфортным, объединяя профессионализм, любовь к природе и стремление к новым высотам.
 
Здесь вы можете забронировать уникальный полёт на воздушном шаре или познакомиться с горными лыжами.

📌 Что я могу:
- Рассказать о нас
- Показать программы полётов на воздушном шаре
- Принять заявку на обучение катанию на горных лыжах
- Помочь оформить бронирование

Выберите, что вас интересует — и отправляйтесь в приключение прямо сейчас!
"""

ABOUT_CLUB = """
🏔 Клуб Высоких Приключений — ваш проводник в мир экстрима и свободы.

Мы специализируемся на:
🎈 Полётах на воздушных шарах над Сочи и Красной Поляной
⛷ Обучении катанию на горных лыжах (скоро сезон)

📍 Все наши программы проходят в живописном Сочи — городе, где встречаются море, горы и небо.
"""

BALLOON_MENU = """
🎈 Воздушный шар
Выберите программу или информацию:
"""

PROGRAM_SOLO = """
🌟 *Соло-программа*
✓ Персональный полёт  
✓ Идеально для тех, кто хочет необычно провести время своей компанией без посторонних людей  
💵 Стоимость:
1-2 чел: 🔥40 000₽ (было 50 000₽)
2 чел: 🔥45 000₽ (было 70 000₽)
3 чел: 🔥55 000₽ (было 80 000₽)
"""

PROGRAM_GROUP = """
👥 *Групповой полёт*
✓ Экономия до 30%
✓ Новые знакомства
💵 Стоимость:
1 чел: 🔥22 500₽ (было 25 000₽)
2 чел: 🔥36 000₽ (было 40 000₽)
3 чел: 🔥45 000₽ (было 50 000₽)
"""

PROGRAM_FAMILY = """
👨‍👩‍👧‍👦 *Семейный полёт*
✓ Специальные условия для семей
💵 Стоимость:
2+1: 🔥54 000₽ (было 60 000₽)
2+2: 🔥63 000₽ (было 70 000₽)
2+3: 🔥72 000₽ (было 80 000₽)
"""

FAQ_TEXT = """
📋 *Частые вопросы и Условия полёта*
🌤 *Погодные условия:*
- Безопасная скорость ветра: до 3 м/с
- Температура воздуха: не выше 30°C
- Видимость: более 300 метров
- Отсутствие осадков, грозы, сильной турбулентности
👥 *Требования к участникам:*
- Минимальный возраст: 6 лет (в сопровождении взрослых)
- Максимальный вес: обычно до 110 кг/чел
- Одежда: удобная, по погоде. Закрытая обувь обязательна
- Не допускаются лица в состоянии алкогольного опьянения
- Беременным женщинам на поздних сроках полеты не рекомендуются
📍 *Полётная зона:*
- Основная зона: окрестности с. Солохаул
- Место встречи: [Развилка Солохаул](https://yandex.ru/maps/-/CHvnqAIJ  ) 
✈️ *Процедура полёта:*
1. Встреча на Развилке
2. Трансфер к месту старта (~15–30 мин)
3. Подготовка шара, инструктаж
4. Полёт (~45–60 мин)
5. Посадка, шампанское
6. Возвращение
⏳ *Общее время:* ~3–4 часа
⚠️ *Важно:* решение о полете принимает командир.
"""

CONTACTS_TEXT = """
📞 *Контакты Клуба высоких приключений*
*Телефон для связи и бронирования:*
☎️ [+79603949943]
📱 [WhatsApp](https://wa.me/79603949943 )
💬 [Telegram](https://t.me/Anna_moreva ) 
*График работы:* Ежедневно с 8:00 до 21:00
📍 *Место встречи перед полетом:*
[Развилка Солохаул на Яндекс.Картах](https://yandex.ru/maps/-/CHvnqAIJ  )
*Наши социальные сети:*
- [Instagram](https://www.instagram.com/hiad_club?igsh=bTlhcXhkaWtpZGp1&utm_source=qr )
"""

SKI_MESSAGE = """
⛷ Готовимся к зимнему сезону 25-26!
Скоро тут будут анонсы выездных кемпов на Уральские и Кавказские горы, Хибины и даже Альпы.
"""